year
student
private
baptist
school
allegedly
killed
teacher
wounded
firing
filled
classroom
apparently
snapped
pastor
happened
george
sweet
atlantic
shores
church
good
christian
pride
discipline
kids
sophomore
arrested
charged
degree
murder
attempted
malicious
assault
related
felony
charges
friday
morning
shooting
police
release
boy
juvenile
neighbors
relatives
identified
nicholas
elliott
students
semiautomatic
pistol
jammed
fired
floor
crying
jesus
save
god
friends
family
troubled
grandmother
death
divorce
parents
classmates
grandfather
clarence
saturday
separated
years
ago
williams
died
long
illness
grandson
fascinated
guns
talking
knew
lot
names
big
slain
karen
farley
sam
marino
condition
gunshot
wounds
shoulder
shot
susan
allen
fled
room
running
bible
class
meeting
youngster
glass
locked
door
opening
fire
spokesman
lewis
youth
maurice
miracle
didn
people
chief
charles
wall
motive
detective
tom
primary
target
classmate
officers
found
appeared
molotov
confiscated
gun
spent
shell
fourteen
rounds
carried
purchased
adult
request
adding
authorities
interviewed
withheld
pending
investigation
federal
bureau
alcohol
tobacco
firearms
shootings
occurred
complex
portable
classrooms
junior
senior
high
main
building
kindergarten
grade
reconstruct
sequence
events
resolved
body
hour
group
offered
sell
oil
israel
discount
million
promised
bomb
proposed
iraqi
pipeline
foreign
ministry
official
wednesday
prime
minister
shimon
peres
offer
bruce
partner
san
francisco
based
construction
engineering
company
told
press
discussed
government
ministers
spoke
anonymity
comments
marked
time
acknowledged
made
assurances
planned
billion
run
border
jordan
built
flynn
vice
president
public
relations
make
swiss
financier
knowledge
consent
point
development
project
handling
proposals
submitted
include
specific
arrangements
disposal
reached
terminal
asked
israeli
believed
representative
speaking
behalf
misrepresented
jerusalem
post
quoted
sources
close
sales
conducted
party
secret
iraq
man
sees
day
thirty
percent
crazy
ideas
things
work
mentioned
september
memo
attorney
general
edwin
meese
iii
referred
arrangement
effect
receive
friend
robert
wallach
states
denied
portion
funds
directly
labor
reference
political
leads
focus
possibly
improper
payment
wrongdoing
denounced
complete
nonsense
native
relayed
earlier
thought
important
thing
port
thinking
put
position
wage
war
concern
person
answering
telephone
residence
town
comment
gunman
woman
hostage
foiled
attempt
steal
jewelry
belonging
late
entertainer
museum
stay
cool
margaret
sat
give
clear
escaped
unharmed
sunday
evening
incident
bag
tools
including
case
administrator
sister
law
wanted
prepared
mrs
worked
closing
office
deliver
plant
produced
forced
inside
refused
offers
money
receipts
purse
wasn
interested
cash
checked
place
warn
cleaning
slipped
back
called
tied
hands
feet
taped
mouth
moved
part
ready
pop
heard
noise
walked
front
pointed
bound
shoot
car
recalled
sidewalk
pretending
legs
collapsed
lift
couldn
leaned
minute
figured
pick
shaken
bearing
marks
ropes
monday
working
staying
home
hugh
perry
las
vegas
lengthy
arrest
record
dating
metro
edwards
city
top
tourist
attractions
featuring
memorabilia
gained
fame
retained
sophisticated
security
systems
add
guards
february
complications
due
aids
founded
fund
foundation
performing
arts
scholarships
music
art
colleges
universities
united
today
oct
days
left
reminder
daylight
saving
ends
tomorrow
local
fall
highlight
history
black
tuesday
descended
york
stock
exchange
prices
amid
panic
selling
thousands
investors
wiped
america
great
depression
began
date
sir
walter
raleigh
english
military
poet
executed
london
pennsylvania
founder
william
penn
landed
chester
mckinley
assassin
leon
electrocuted
american
joseph
pulitzer
charleston
republic
turkey
proclaimed
secretary
henry
drew
number
peacetime
draft
lady
frances
cleveland
preston
baltimore
age
launched
invasion
egypt
sinai
peninsula
brinkley
report
premiered
nbc
nightly
television
newscast
replacing
camel
news
caravan
thieves
star
india
priceless
natural
recovered
men
convicted
stealing
national
organization
women
sheik
ahmed
saudi
arabia
figures
petroleum
exporting
countries
dismissed
ten
responding
rebuke
jimmy
carter
menachem
begin
reaffirmed
country
expand
existing
jewish
settlements
occupied
west
bank
gaza
strip
coffins
servicemen
beirut
truck
bombing
led
grenada
arrived
dover
air
force
base
delaware
confirmation
defeat
bork
serve
supreme
court
reagan
announced
choice
douglas
nomination
trouble
revelations
past
marijuana
birthdays
singer
melba
moore
actor
richard
actress
jackson
experienced
understand
print
duncan
modern
dance
pioneer
message
lovers
valentine
volunteers
lining
spread
word
world
send
special
ted
thompson
coming
wife
started
program
estimated
latest
song
bird
brings
recently
inspiration
takes
satisfied
hard
born
write
stamped
pieces
mail
passed
hand
citizen
charge
extra
touch
begins
continues
feb
administration
weighing
invoke
authorizing
seizure
tax
payments
businesses
operating
panama
adviser
colin
powell
economic
sanctions
applied
created
pressure
ouster
strongman
gen
manuel
antonio
noriega
examining
additional
brought
bear
briefed
reporters
giving
vacationing
update
panamanian
problem
grounds
publicly
encourage
move
defense
forces
oust
firmly
control
month
effort
foster
discontent
assure
taking
situation
remove
sound
decision
corporations
balked
escrow
account
hamper
operations
reason
white
house
advisers
officials
studying
implications
international
emergency
powers
act
authorize
seize
cautious
powerful
tool
staff
washington
pros
cons
continue
apply
provide
consideration
discuss
options
weighed
dispatch
troops
deployed
central
early
week
army
lieutenant
believes
reasonable
americans
living
installations
dim
view
jesse
contacts
diplomatic
visits
cuba
syria
disclosure
letter
weeks
resign
state
department
spokeswoman
phyllis
oakley
communications
grip
power
proliferation
channels
tactic
buy
communication
needed
exclusively
marlin
fitzwater
traveling
california
criticized
democratic
presidential
candidate
involvement
bipartisan
coordinated
plan
dealing
congress
dealt
successfully
adversaries
traveled
persuaded
fidel
castro
prisoners
talks
hafez
assad
won
freedom
pilot
detained
efforts
earned
enthusiastic
plans
travel
resolve
crisis
soldiers
marines
headed
joining
stationed
southern
command
pentagon
increase
facilities
senate
committee
evidence
complicity
drug
trafficking
jose
document
offices
proof
knowingly
established
policies
supported
business
intelligence
consul
defected
guatemala
costa
rica
agrees
step
accused
achieve
goal
contributed
paralysis
appearing
milwaukee
renewed
call
leave
released
rejected
dictated
duration
commander
governed
constitution
releasing
exile
remain
convinced
interests
reiterate
moral
appeal
depart
skins
protected
species
smuggled
japan
months
stolen
export
documents
wildlife
protection
thursday
traffic
trade
monitoring
wide
nature
south
shipped
route
involving
asian
tons
entered
thailand
larger
shipment
loaded
asia
ships
coast
uruguay
end
declared
customs
yen
retail
times
belts
permits
required
regulations
convention
endangered
cites
treaty
regulating
plants
animals
japanese
allowed
shipments
enter
proper
verification
statement
revealed
uncovered
paper
trail
illegal
colombia
chile
venezuela
singapore
mask
origins
industry
responded
instituting
voluntary
check
system
imports
legal
penalties
improvement
profits
involved
night
organized
union
boost
single
caucuses
michigan
members
wield
clout
leaders
assuming
michael
dukakis
eventual
nominee
prevented
endorsing
appears
growing
rank
file
support
votes
candidates
primaries
gephardt
considerable
hearts
majority
workers
half
auto
summary
developments
forest
brush
fires
western
jean
pierre
extreme
leader
marie
pen
automobile
accident
attended
miles
paris
capital
ran
road
smashed
tree
member
leadership
jan
held
degrees
marketing
active
movements
vote
elections
district
highest
percentage
france
wing
election
deputy
mayor
elected
assembly
lost
seat
legislative
summer
strongly
opposed
highly
centralized
bureaucratic
personal
taxes
favors
penalty
priority
french
citizens
jobs
stopping
immigration
round
surprising
worrying
feared
racist
sentiments
residents
evacuated
torrential
rains
flooded
indian
reported
victims
lived
worst
affected
homes
floods
relief
camps
southwest
delhi
drowned
houses
monsoon
broke
newspapers
northeastern
eastern
betty
buckley
sang
theater
service
rose
vacation
dominican
mine
elegance
standards
miss
mystery
england
broadway
tony
awards
chairman
revival
fair
holmes
composed
presence
beam
lifts
ceiling
maureen
mcgovern
played
daughter
pirates
favorite
jack
failed
honesty
depth
humor
skill
judy
kaye
phantom
opera
actors
planet
howard
larry
dogs
whistle
robb
spotlight
familiar
son
lyndon
johnson
governor
conservative
lawyer
arena
decisive
style
fashioning
huge
victory
republican
dawkins
retired
lobbyist
identify
mainstream
values
crucial
success
level
strong
fiscal
responsibility
precincts
counted
marine
combat
officer
career
making
democrats
virginia
social
aide
married
race
bid
elective
sweep
popular
credited
bureaucracy
major
gains
education
funding
opened
positions
authority
blacks
appointed
architects
spring
super
intended
collective
strength
tenure
prison
troubles
attention
row
inmates
succeed
practicing
unemployed
job
article
august
issue
society
magazine
ambassadors
wound
column
mohamed
note
concluded
reversing
tide
reports
rate
factories
mines
utilities
november
inflation
reserve
board
industrial
capacity
points
seventh
edges
economists
fear
producing
goods
meet
demand
leading
shortages
price
increases
accompanying
production
climbed
brisk
identical
rise
october
fed
index
stands
reflecting
light
manufacturing
equipment
jumps
line
expectations
statistics
portrayed
robust
economy
sector
bolstered
caused
lower
dollar
makes
affordable
overseas
markets
producers
durable
ticket
items
ranging
higher
rates
recorded
gain
metals
industries
jumped
december
attributed
steel
mills
motor
vehicle
parts
fourth
consecutive
hit
peak
surge
electricity
conditioning
mining
includes
gas
drilling
increased
declined
reflection
driven
boom
spending
modernize
accompanied
stronger
automobiles
assembled
annual
units
slightly
flat
stood
output
declines
jump
total
increasingly
dangerous
young
children
doctors
unprovoked
attacks
babies
ears
bitten
constructive
surgery
infant
suffered
bites
requiring
john
paisley
brian
lauer
journal
medical
association
asleep
university
colorado
medicine
suitable
families
small
claim
buying
severe
injuries
ferret
bite
loosen
hold
child
incidence
unknown
require
health
period
arizona
ratio
pet
population
compared
cats
sale
ownership
prohibited
georgia
hampshire
ban
north
carolina
strait
path
dakota
kansas
ranch
soft
singing
texan
ceremony
smiled
hat
talked
stuff
award
acts
tour
towns
cities
winter
stop
appearances
return
mind
beer
commercials
fast
rising
kentucky
figure
means
cut
hair
locks
longer
crystal
gayle
greg
martin
album
nashville
vocal
double
winner
garth
brooks
horizon
video
tennessee
ernie
ford
inducted
hall
honor
winners
performed
tonight
older
nationally
televised
presentation
clint
male
vocalist
kathy
female
honors
judds
wynonna
mother
naomi
picked
duo
vince
gill
event
performers
sing
morgan
husband
keith
whitley
songwriter
jon
johnny
received
musician
bush
felt
nervous
voted
adopted
texas
ended
campaign
telling
voters
referendum
philosophy
life
barbara
hotel
conference
set
polling
couple
visited
headquarters
talk
emerging
voting
booth
feel
outcome
replied
predictions
gop
personally
dozen
calls
kidding
expressed
skepticism
key
showed
reporter
explaining
speak
language
added
hui
happy
glad
relaxed
exercise
watch
returns
houston
condominium
wrapped
final
swing
ohio
missouri
rally
shopping
mall
stars
lynn
entertained
thousand
fans
peace
prosperity
crowd
alive
deep
heart
paid
themes
rival
experience
affairs
risk
broadcast
networks
aired
spot
viewers
minutes
commercial
featured
scenes
endorsement
respect
opponent
admire
devotion
guided
fundamentally
divide
honest
difference
opinion
approach
lead
secure
echoed
elect
mention
mate
sen
dan
quayle
indiana
qualifications
mood
nationwide
polls
holding
addressing
rallies
suburb
detroit
rural
ashland
louis
calling
reject
liberal
meant
ahead
ups
downs
written
experts
visiting
listening
confident
trust
judgment
immediately
shift
start
future
interview
radio
corp
nation
largest
transmission
subsidiary
biggest
independent
concerns
recent
transactions
reserves
strengthen
substantially
financial
flexibility
pursue
attractive
opportunities
energy
kenneth
lay
trillion
cubic
barrels
entire
sold
average
risen
completion
realizing
shareholders
tremendous
inherent
assets
current
favorable
market
conditions
proceeds
reduce
interest
expense
enhance
term
earnings
flow
debt
reduction
reduced
quarter
share
normal
temperature
patterns
warm
heating
seasons
weather
resulting
coupled
proved
beneficial
reflect
adoption
changed
accounting
rules
reducing
income
benefit
change
relative
expenses
nasa
scientists
pretty
test
photos
magellan
probe
difficulties
spacecraft
circled
venus
fifteen
hours
contact
earth
signal
midday
expected
instructions
properly
aim
manager
spear
pictures
collected
radar
problems
developed
raw
images
looked
waiting
returned
areas
scientist
steve
saunders
show
flows
faults
fractures
jet
propulsion
laboratory
concerned
hear
stressed
computer
programs
automatically
find
originally
outage
conducting
rushed
space
network
station
calif
healthy
loss
short
afterward
unexpected
expect
controllers
sense
hearing
overnight
silence
engineers
fixed
procedure
routinely
performs
completed
establish
jim
doyle
previous
craft
stations
australia
assumption
wrong
detected
protective
sun
solar
array
guide
programmed
routine
locating
searching
wake
flawed
hubble
telescope
hydrogen
fuel
leaks
temporarily
grounded
shuttle
fleet
formal
mission
map
surface
supposed
aug
adjust
waves
focused
lab
sherry
covered
thick
clouds
prevent
cameras
rugged
landscape
penetrate
collect
reflected
maps
nearest
planetary
neighbor
atlantis
orbit
mile
journey
soviet
photographed
area
yield
global
designed
distinguish
features
football
fields
detail
suspect
bit
ear
dog
injured
animal
neck
chase
patrol
constable
philip
natal
provincial
weekend
suspicious
individuals
searched
chased
turned
treated
injury
veterinary
clinic
face
property
nikkei
closed
tokyo
grassland
biography
finally
published
novelist
publisher
simon
schuster
acquired
book
understanding
april
words
tells
relationship
mentor
lover
deals
greatest
reluctant
movie
queens
gilbert
montgomery
taylor
melvyn
recalls
rumored
fact
pursued
cutting
slashing
costs
admits
cuts
doubt
orders
cost
institution
filed
expects
loans
slumping
decline
continued
deterioration
real
estate
adversely
impact
corporation
recovery
reductions
workforce
combination
layoffs
attrition
asset
frozen
hiring
eliminated
bonuses
suspended
raises
analysts
moves
footing
remains
extremely
shaky
gave
similar
assessment
securities
commission
unsuccessful
external
assistance
parties
regulatory
largely
bad
addition
borrowers
experiencing
difficulty
sign
spreading
portfolio
gerard
analyst
tucker
anthony
cooperating
employees
notify
decisions
difficult
painful
lawrence
fish
steps
essential
viability
ability
rebuild
smaller
customer
maintenance
credit
quality
canceled
named
march
ordered
review
direction
structure
personnel
measures
approximately
action
strategic
outlining
directions
details
signed
tight
guidelines
lending
practices
james
moynihan
boston
predicted
eventually
subsidiaries
connecticut
maine
rhode
island
order
survive
massachusetts
results
successful
competitive
concentrate
banking
processing
services
large
corporate
leasing
brokerage
disclosed
sued
mutual
insurance
maintains
speed
principal
faces
lawsuit
executives
status
disclosing
mounting
sooner
heaviest
ground
soil
deployment
arab
manning
standoff
dozens
tanks
bradley
armored
infantry
fighting
vehicles
scores
heavy
rolled
transport
trip
desert
weapon
burgeoning
arsenal
imposing
carrying
cannon
accurate
speedy
mph
mechanized
division
distance
kuwait
buildup
reach
planes
arriving
clock
weaponry
awaited
commanders
multinational
boss
sgt
ronald
cadillac
model
vietnam
era
brigade
formidable
primarily
versions
models
comparable
armor
equivalent
considered
superior
weapons
sighting
guidance
strategy
tank
superiority
british
inflict
damage
col
barry
bring
iraqis
training
technology
numbers
crews
clean
sand
sandinista
cease
extended
negotiators
enduring
rebels
azucena
contras
proposal
shows
lack
noted
expires
extend
propose
humberto
ortega
leftist
delegation
extension
improve
negotiations
agreement
accord
provisional
truce
backed
sandinistas
sides
negotiate
conflict
lives
estimates
brother
daniel
shortly
delegations
resumed
red
cross
humanitarian
aid
rebel
combatants
gather
safe
zones
read
victor
hugo
facilitate
process
contra
previously
agreed
fighters
differed
operational
negotiating
session
met
managua
divided
opposing
bargain
faith
issues
purpose
reaching
adolfo
calero
unsuccessfully
enrique
bermudez
directors
split
ostensibly
civilian
directorate
influence
argues
movement
threat
objective
dispel
rumors
disunity
issued
miami
declaring
ranks
sectors
cuban
broken
ring
operated
havana
food
store
numerous
basic
prensa
agency
monitored
mexico
grocery
scheme
quantities
inflated
places
bidder
worker
products
distribution
inefficiency
encourages
speculators
consumers
wait
lines
scarce
sears
roebuck
revolution
enterprise
communist
experimental
farmers
growers
surpluses
apologized
crimes
stalin
imprisoned
polish
buried
mass
graves
confession
denial
improved
insisted
nazi
germany
responsible
massacre
historians
blamed
josef
killing
captured
soviets
beginning
bodies
cream
admission
nazis
discovery
east
parliament
holocaust
deaths
millions
tass
mikhail
gorbachev
wojciech
jaruzelski
poland
urged
admit
slayings
blank
spots
barrier
copies
material
archives
poles
speech
dinner
honoring
historical
cast
discovered
indirectly
testify
woods
century
fell
evil
easy
tragedy
truth
lies
genuine
renewal
side
expressing
regret
connection
stalinist
criminals
solidarity
lech
walesa
gdansk
reparations
loyal
statements
supporting
scheduled
visit
memorial
invaded
hitler
head
stacked
layers
german
propaganda
purposes
questioning
version
admitted
congressional
policy
glasnost
deeds
touched
greater
openness
records
transferred
camp
rest
predecessor
kgb
ukraine
northwest
moscow
disappeared
historian
writing
weekly
operation
potential
carefully
warsaw
pleased
live
father
wives
arco
chemical
inquiry
explosion
stymied
response
negligence
judge
granted
temporary
restraining
preventing
richfield
scene
los
angeles
owns
osha
releases
americas
sandra
lucas
davis
gregory
scott
partial
list
smith
prohibit
occupational
safety
damaged
assistant
focusing
complaints
earl
shifts
harold
concentrating
helping
deal
stabilized
ripped
utility
determined
initially
fix
compressor
initial
speculation
austin
contract
gallon
exploded
driver
vacuum
assigned
concentration
flew
europe
restore
lose
pay
annually
produces
pounds
oxide
flexible
foam
insulation
drinking
cups
packaging
materials
automotive
component
replacement
gasoline
facility
series
explosions
phillips
pasadena
claiming
injuring
sank
persian
gulf
pushed
sharp
straight
remained
mild
consumer
increasing
pace
produce
absent
outbreak
shock
burden
brink
recession
aren
roughly
growth
economist
donald
spend
christmas
core
excluding
pickup
helped
benefits
january
recipients
boosting
aftermath
hurt
merchandise
deficit
offsetting
modest
exports
shrugged
dow
jones
stocks
advancing
traders
belief
worries
unjustified
extremes
separate
adjusting
tracking
soared
stabilize
barrel
july
feeding
chemicals
airline
tickets
permanent
david
aubrey
lanston
dealer
simply
suffer
kind
inflationary
psychology
shocks
anticipation
stimulating
agree
budget
beverage
moderate
care
bringing
clothing
boys
girls
infants
shoes
edged
remaining
unchanged
dealers
lagging
unable
discounted
financing
housing
motel
selection
costing
walking
pittsburgh
street
cry
recognition
hey
runner
guess
alike
greeting
italian
ballot
train
flying
win
surviving
competitor
tighten
crown
margin
delegate
count
campus
welcoming
kitty
graduate
cold
cloudy
region
devastated
coal
opportunity
matter
parallels
present
pain
distress
communities
drawing
debates
investing
exotic
marginal
resources
rev
infrastructure
brushed
suggestions
prepare
chartered
amtrak
nicknamed
unlimited
resisted
urging
massive
involve
priorities
aircraft
carriers
rebuilding
railroads
highways
critical
oppose
task
afford
thinks
fundamental
tired
crumbling
bridges
airports
homeless
streets
suppose
household
guerrillas
laid
arms
southeast
guerrilla
wong
collapse
communism
offenses
included
licenses
contracts
veterans
cases
convictions
retirement
welfare
disability
grants
enforcement
anti
offender
drive
suspension
conviction
repeat
implement
drunken
driving
provided
aviation
modify
registration
certificate
ensure
positive
timely
identification
owners
pilots
coordination
objectives
diminishing
winds
firefighters
battle
acre
steep
rocky
terrain
montana
controlling
grass
cattle
destroyed
killer
disposing
contained
struggled
lightning
charred
acres
trees
burned
pockets
pine
lands
twenty
afternoon
storm
payne
phoenix
allowing
consolidating
blaze
consumed
hope
peaks
slopes
ranged
apparent
homicide
victim
county
sheriff
investigators
dumped
ablaze
fanned
gusting
wind
shifted
ocean
mike
managed
raced
parched
destroying
cows
sparked
roosevelt
lyle
flames
quickly
withdrawn
guys
keeping
eye
checks
departments
unsure
displaced
widely
scattered
hay
hundreds
eat
salvadoran
alfredo
attracted
protesters
harvard
play
match
peter
princeton
team
playing
demonstrated
gymnasium
banging
pans
gathered
cambridge
demonstrators
letters
alice
wolf
belmont
arlington
projects
salvador
continuing
human
rights
abuses
raids
frequently
justifies
sends
armed
judging
behavior
gov
kay
orr
bitterly
radioactive
waste
warehouse
threatened
boyd
populated
ranching
northern
edge
turmoil
low
rancher
opposes
hunger
strike
nebraska
implied
threats
jeff
lacked
elements
doug
understands
nuclear
dispute
wouldn
disclose
hoped
deteriorate
understood
bill
confidence
site
village
supporters
welcomed
dump
opponents
accidents
effects
developer
chosen
interstate
compact
build
reinforced
concrete
arkansas
louisiana
oklahoma
gubernatorial
ben
nelson
sonny
absolutely
threatening
condone
activity
community
lowell
fisher
spencer
sept
stupid
emotionally
upset
intends
water
diet
objects
holds
lacks
czechoslovak
embassy
representing
ctk
grace
permit
cope
jeopardizing
represented
consular
ties
severed
sections
enable
maintain
full
fledged
embassies
alternate
replace
assumes
governments
seek
prague
officially
activities
auspices
source
suggested
perform
function
unidentified
opinions
exercising
differences
prompted
czechoslovakia
democracy
toppled
ruled
deteriorating
embraced
singled
premises
cubans
claimed
dissidents
czechoslovaks
rightfully
presumed
discredit
regime
eyes
middle
iran
seeking
partners
counter
aggression
dramatic
baker
pipelines
freezing
compensate
revenue
refueling
enforcing
boycott
nations
council
kelly
damascus
coordinate
syrians
verified
syrian
intense
bloody
saddam
hussein
longtime
rivals
socialist
listed
sponsoring
terrorists
removed
terrorist
groups
lebanon
longest
undertake
specifics
eduard
shevardnadze
conversation
resolution
cooperation
carry
dispatched
naval
blockade
enforce
approved
unanimously
protecting
ousted
kuwaiti
sanctuary
demanded
decide
participate
mounted
bucked
trend
dipped
cent
survey
grades
types
cents
june
falling
motorists
pulls
director
dip
competition
pumps
regular
unleaded
premium
leaded
gallons
reform
agencies
turn
jointly
tension
bureaucrats
frustrated
privileges
demands
initiative
uneasy
modernization
fail
materialize
productivity
avoid
widespread
study
failure
tensions
minimum
vigorously
ultimately
question
reforms
resistance
levels
kremlin
yegor
ligachev
criticism
slow
boris
yeltsin
presented
joint
panel
inherited
aging
inefficient
ambitious
create
dynamic
poor
transportation
disruptions
introduction
gross
product
grew
brezhnev
referring
leonid
prevailed
stagnant
gnp
contrast
hampered
agriculture
disruptive
machine
grow
loser
standard
variety
reasons
outlook
confusion
deficiencies
prospects
comprehensive
respects
inconsistent
regard
timing
goals
acceleration
pronounced
traditional
planning
administrative
procedures
dramatically
thrust
unprepared
owned
census
firms
minority
companies
detailed
information
sole
averaged
contractors
chicago
throat
waits
fought
served
stranger
knife
gut
spilling
slight
frame
rattle
causing
shake
sandy
haired
victimized
aggravated
decade
attack
swept
optimism
devil
story
hometown
happen
roberts
murders
headlines
assaults
dwarfs
killings
forever
trauma
rough
stein
columbus
crime
interviews
households
navy
diving
carrier
tent
park
strangers
struck
friendly
warning
stabbed
abdomen
gear
wedding
catch
voice
free
dragged
dirt
pressing
chin
chest
blood
hospital
undergoing
emerged
scared
trigger
stopped
maryland
elder
enjoy
meantime
attacker
pleaded
guilty
sentence
freed
prisoner
fears
assailant
guarded
loud
awash
deputies
employ
baby
discharged
desperate
psychiatric
slowly
teaching
attending
college
hoping
piece
andrew
turner
criminal
justice
instructor
tech
arranged
guy
survived
healed
needing
emotional
finds
speeches
therapeutic
toll
cracks
strain
controls
conceded
transfusions
tested
deadly
disease
refuses
die
zoo
advocacy
elephant
veterinarian
treat
abuse
keller
receiving
elephants
mistreated
gail
treating
ton
attacked
stable
defended
hooks
methods
abusive
saul
pound
michele
beating
hitting
paul
hunter
hooked
instrument
hook
beaten
bombs
affluent
neighborhood
rescue
bombings
mark
escalation
employment
urban
commandos
devices
liberation
civil
pits
marxist
centrist
blowing
bits
throwing
foot
roof
parking
hamburger
chain
restaurants
shattered
windows
yards
stores
wealthy
clandestine
rear
guard
countryside
oppressed
consequences
rich
miguel
angel
torres
eyesight
owner
injustice
terrorism
industrialist
fbi
quota
hispanics
agents
ranking
testified
recruit
otto
executive
quotas
minorities
sessions
discrimination
attorneys
hispanic
joined
suit
contend
track
promotion
management
plaintiffs
assignments
unspecified
damages
testimony
undesirable
locations
glamorous
successes
retreat
sit
melvin
equal
unfounded
felix
baxter
forward
conventions
recruiting
agent
speaks
specialists
requested
loophole
rule
undercover
listen
tasks
jury
trial
render
entitled
trials
suing
societe
maxwell
result
gaining
stake
belgium
cooperate
creating
venture
possibility
acquiring
shares
interrupted
macmillan
publishing
acquire
buyout
investment
firm
kohlberg
kravis
resume
drawn
media
concentrated
filmmakers
francis
motion
picture
rating
petition
delivered
oriented
films
pornographic
copy
arbitrary
censorship
address
artists
sponsors
universally
recognized
pornography
suggest
mature
incorporated
film
critically
acclaimed
tie
portrait
serial
scandal
cook
thief
rated
spike
lee
rob
jonathan
ron
penny
marshall
waters
edward
critics
distributor
entertainment
ratings
newspaper
advertisements
theaters
negative
irresponsible
works
unfairly
brands
audiences
devise
spanish
effective
form
page
wrote
subject
challenge
revised
professional
basis
practice
altogether
sex
advertising
exhibition
movies
appointee
shelter
plenty
mcguire
ireland
painter
raymond
appointment
thanksgiving
decided
appoint
impressed
homelessness
ann
sudden
perspective
hopes
globe
politician
nice
content
nurses
menu
revision
macaroni
pool
table
tennis
card
tables
apartment
divorced
florida
jersey
casual
acquaintance
stranded
hanging
directed
representatives
hospitals
inn
legislators
praised
announcement
troop
capitol
reacted
cautiously
numerical
categories
mitchell
incoming
offensive
stalled
speaker
wright
abandon
caution
slam
bob
dole
kan
actions
gift
cutbacks
conventional
vienna
insisting
tim
wirth
colo
interesting
improvements
alan
cranston
danger
warner
urge
artillery
announcements
eliminate
capable
collection
antiquated
rep
les
aspin
wis
politically
significant
warned
fight
wars
reorganize
reorganization
removes
capability
russian
chart
claiborne
pell
profoundly
pledge
allies
advantage
openings
accelerate
momentum
upheld
policeman
slaying
radicals
burt
botha
execution
unconsciousness
placing
soaked
tire
setting
method
suspected
collaborating
soldier
innocent
complained
ruling
resignation
uncertainty
reynolds
equity
european
losses
volume
exxon
lax
spill
learned
valdez
disaster
fulfill
responsibilities
cleanup
environmental
operator
supervisor
duty
arthur
kill
certification
jurisdiction
waterway
pipe
pulled
borough
tests
determine
confirmed
removing
democrat
pro
environment
birds
absorbed
spilled
wreck
alaska
prince
impression
happening
inclined
wipe
duplicated
leo
assess
reiterated
claims
operators
warnings
leak
detection
error
refinery
obtained
trained
certified
operate
factor
confirm
deny
olive
green
drifted
mediterranean
beach
anniversary
transports
dunes
tel
aviv
drop
airborne
leg
korean
artifical
christ
sweat
laden
fruits
paratroopers
express
adventure
crouch
boca
raton
fla
oldest
butt
hurts
fine
river
dare
sitting
smoking
eating
germans
britons
canadians
denmark
founding
taiwan
karl
physician
participated
overcome
jumping
prove
safely
bar
exams
accusing
preparation
questions
undermining
integrity
examiners
examination
multiple
administered
graduates
accuses
studies
philadelphia
santa
monica
sending
exam
reviewing
tape
allegations
applicants
tainted
operates
preliminary
seeks
copyright
infringement
enrolled
courses
seminars
cassette
tapes
subjects
committees
practitioners
judges
professors
reviewed
portions
essay
section
iowa
preparations
summit
tackle
bare
bone
essentials
agreements
progress
cultural
leaves
uncertain
citing
unhappiness
lithuania
enact
legislation
emigration
devoted
celebration
obstacles
stand
transforming
hardship
fueled
semitism
plotted
extermination
jews
kurt
repeated
requests
lifting
role
sponsored
persecution
berlin
switzerland
reich
delegates
attend
traumatic
villa
solution
worldwide
coincide
unconditional
surrender
yitzhak
shamir
enemies
learn
lessons
heavily
dangers
emphasized
recall
edgar
teach
lowest
indications
decades
mismanagement
economies
jobless
youths
extremism
blaming
foreigners
ills
search
scapegoat
jew
forefront
kicked
tens
leaving
emigrate
looser
religious
expose
feeling
lionel
romania
hungry
heinz
neo
rampage
shouting
insults
survivor
downfall
steinberg
emotions
neal
investigations
engaged
entry
atrocities
approaches
rebuffed
abc
roseanne
cosby
season
comedy
starring
barr
tenths
represents
research
easily
dominant
cbs
awaiting
beckman
cited
cable
fledgling
fox
factors
absence
sports
honduran
protest
maj
protested
staged
palmerola
jail
arrests
expelled
honduras
passports
threw
chained
gates
compound
protests
independence
celebrate
spain
violent
immoral
tegucigalpa
hartford
conn
patricia
creek
medal
roman
catholic
priest
sara
dale
remembering
join
domination
declaration
demanding
audience
ambassador
michel
kraft
battery
worth
maker
alkaline
batteries
acquisition
excited
richman
informed
definitive
unit
creation
surprise
fetch
brand
marketplace
prudential
bache
pleasant
composite
trading
copper
ralston
purina
domestic
fastest
segment
compete
carbon
dominated
recorders
attract
diversify
dean
witter
leveraged
generated
internally
stick
holdings
formed
specializes
buyouts
borrowed
repaid
sidestepped
warming
forestry
pledged
curb
blocking
wishes
industrialized
dioxide
emissions
contribute
chancellor
helmut
kohl
tougher
commitments
communique
substantive
reasoned
radical
throw
planks
forge
destruction
brazil
tropical
rain
forests
emphasize
conservation
biological
diversity
proportions
absorb
contributing
commitment
brazilian
signing
stated
obligation
challenges
climate
ozone
pollution
environmentalists
abandoned
promise
urgent
rhetoric
coalition
prominent
becker
sierra
club
cover
inaction
leaf
contentious
vague
compromise
implementing
stem
unclear
sluggishness
slashed
manufactured
inventories
purchasing
measurement
weight
slipping
tumbled
sharpest
monthly
reflects
weakening
dull
nikko
businessmen
managers
ending
reading
generally
declining
inventory
manufacturers
undoubtedly
weaken
decrease
sixth
purchasers
quantity
purchases
weakness
casts
shadow
bond
softening
surged
bellwether
treasury
finished
tumbling
significance
accounts
indicator
shown
signs
weak
lloyds
plc
segments
textiles
sulfur
lumber
fuels
steady
indicating
decreased
lesser
accustomed
terrified
premiere
fantasy
frighten
bachelor
reaction
worried
moments
curtain
stage
voyage
galaxy
imagination
packed
kennedy
center
lights
thunder
shook
seats
balloon
rocking
gently
strange
bathed
aliens
pair
fat
musical
mud
jerky
ultraviolet
score
scenery
centerpiece
festival
dancers
travels
dallas
orange
mesa
terror
youngsters
plays
cheered
coveted
visionary
returning
behave
creatures
encounter
exploration
planets
innocence
love
color
motions
curious
shapes
suddenly
sounds
humming
beethoven
symphony
bang
dark
vision
scored
girl
retailers
necessarily
chains
posted
holiday
saved
lackluster
performance
discounts
aggressive
promotions
china
protect
transfer
land
daily
amendments
privately
entities
chinese
exist
develop
complement
defined
individually
enterprises
existed
encouraging
individual
stalls
standing
agenda
moving
brewing
southwestern
snow
utah
wyoming
elevations
inches
skies
cleared
salt
lake
mountains
southeastern
forecast
farther
showers
thunderstorms
stationary
extending
rio
grande
valley
mississippi
unseasonably
highs
heavier
rainfall
totals
est
alexandria
baton
rouge
temperatures
yellowstone
wyo
regional
airport
fort
myers
falls
minn
appalachians
mid
plains
rockies
prevail
upper
lakes
pacific
apprehended
mexican
confirms
downward
passage
commissioner
naturalization
totaled
drought
farm
laborers
immigrants
mexicans
laws
ins
resulted
apprehension
harm
narcotics
applications
resident
restrictive
agricultural
obvious
fraud
fraudulent
fewer
sudan
african
resumption
omar
andre
restoring
reopening
borders
resuming
links
plane
airspace
aboard
flights
heading
junta
overthrew
homemade
turnpike
possession
explosives
leftover
explosive
attempting
flee
trooper
superiors
noticed
acting
parked
gym
canisters
trunk
device
investigative
passport
kyodo
forged
illegally
fingerprints
amount
franco
consulate
supplies
mountain
resort
flooding
landslides
britain
italy
nicaragua
prosecutor
investigate
fatal
nights
quiet
drove
yelled
witnesses
unlike
incidents
violence
hammered
rioters
clashed
funeral
grand
bias
grievances
conduct
todd
crowds
terms
printed
distributed
newark
evenly
whites
fuller
carmen
approached
bottle
feed
grain
purchase
federation
cooperative
associations
completing
consolidated
barge
link
orleans
arm
handles
corn
soybeans
illinois
silos
barges
regions
pushing
restrictions
beef
citrus
fruit
imported
condemned
productions
ailment
associates
dynasty
georges
geneva
functioning
classics
sea
gull
cherry
orchard
uncle
occasions
favored
characters
author
acted
campbell
soup
shareholder
giant
mary
malone
stuart
outstanding
rift
controlled
stockholders
brothers
bennett
comprised
cousins
intention
filings
vacant
immense
managerial
talents
contagious
enthusiasm
inspired
proven
myriad
arise
scaled
inspections
meat
packing
falsifying
acknowledge
maimed
midwest
deregulation
disagree
periodically
complain
tough
violations
levied
deserve
committed
broader
spirit
starting
businessman
hire
bentsen
moment
anne
bonnie
clyde
represent
employers
safer
employed
senator
amounts
farmer
subsidies
richest
subsidy
formula
medium
size
limitation
contributions
farming
neglect
answer
abroad
takeshita
paying
rice
surplus
disposable
open
embargo
net
dollars
pocket
supply
platform
soy
beans
endive
nov
pessimism
wins
comfortably
pitched
prize
electoral
remarks
torpedo
remember
sleep
knowing
mornings
electing
gloomy
limited
obscure
brighter
stakes
celebrities
eastwood
laughed
applauded
generation
gene
buddy
jane
russell
danny
thomas
younger
campaigning
sacramento
omaha
neb
flight
bus
outskirts
leveled
wire
letting
anymore
launching
furlough
kinder
quieter
finish
voiced
reservations
waged
circus
sized
silicon
lieutenants
shape
perception
clara
scare
putting
flags
shrinking
explain
veiled
footage
flag
challenging
examined
promote
protectionist
heads
walls
launch
plunge
beneath
dignity
presidency
cheap
winning
toured
hidden
heated
trible
candidacy
attacking
raising
stan
parris
raised
pledges
raise
coleman
nominate
wilder
governorship
republicans
chance
unhappy
investigating
affair
medication
avalanche
treatment
parkinson
brain
ailments
poised
insights
mental
psychiatry
mount
treatments
diseases
reality
characterized
tremors
huntington
intellectual
abilities
syndrome
researchers
isolated
blueprint
protein
cells
sits
drugs
respond
adjacent
substance
communicate
defining
design
affect
linked
involuntary
tongue
limbs
rats
makeup
partially
olivier
researcher
oregon
sciences
portland
essentially
psychotic
mechanism
underlying
mechanisms
shed
inheritance
tendency
arnold
professor
matching
patients
follow
processes
ease
range
heat
wave
boiling
northeast
break
cooler
canada
blast
districts
schools
periods
opens
hottest
noon
uncomfortable
atmosphere
learning
associate
township
ill
humidity
norm
meteorologist
louisville
hot
rare
push
measure
feels
opposite
fargo
dodge
indianapolis
madison
peoria
sioux
springfield
rockford
achieved
competitors
wearing
uniforms
instruments
drum
corps
championships
artificial
turf
stadium
players
livestock
precautions
ice
chickens
cars
contiguous
edt
settled
forecasts
autumn
preceding
downturn
murphy
edison
feeder
knocked
customers
buildings
manhattan
wider
electric
impose
voltage
clash
electrical
exceed
wild
dick
anderson
neighboring
pope
controversy
diverse
catholicism
outlined
flashing
forbids
educate
politics
violated
clerical
dressed
golden
quick
vast
virtual
binding
element
notorious
albania
javier
navarro
vatican
latin
complicated
bet
conservatives
liberals
revenge
foe
papal
faithful
politicians
proves
impossible
columnist
garcia
influential
carlos
salinas
gortari
dec
mandate
institutional
revolutionary
inauguration
surprised
constituency
invited
hinted
envoy
establishing
greeted
coffee
grateful
pray
monsignor
constitutional
distinguished
visitor
spiritual
cardenas
addressed
controversial
pleading
greatly
contraception
suffers
poverty
malnutrition
materialism
greed
monterrey
enormous
capitalist
culture
abortion
lust
limit
fend
protestant
languages
converting
revitalize
benjamin
cruz
psychiatrist
throng
catholics
sad
forgotten
shared
glimpse
leaped
podium
fence
mix
murderers
traffickers
yard
chorus
ode
joy
municipal
game
reception
questionable
lined
parade
basilica
guadalupe
fathers
finest
tarmac
mathematical
minds
tops
ways
recount
gutierrez
jokes
squads
waving
bedroom
silent
loved
ultimate
rode
closer
wedtech
racketeering
mario
defendants
theft
defunct
bronx
contractor
corruption
wilson
stanley
stole
indictment
defendant
presumption
looted
bernard
eldest
conspiracy
maximum
alleged
extortion
bribe
perjury
filing
false
coach
olympic
location
appealing
asylum
secluded
gerry
ottawa
canadian
romanian
games
calgary
reportedly
sought
refugee
angry
handle
defector
athletes
coaches
abruptly
defect
superintendent
cup
background
buffalo
mice
rooms
technician
linda
escape
indication
notes
random
experiments
belonged
skeptical
explanations
mysterious
blitz
disturbing
epidemic
sort
lethal
lecture
slide
stemmed
batch
contaminated
meal
sverdlovsk
ural
explanation
unanswered
gary
crocker
specializing
relating
fit
facts
alleging
institute
spewing
infectious
occurs
naturally
superpowers
bars
aimed
defenses
oberg
uncovering
disasters
warfare
observers
undo
secrecy
inflicted
vladimir
specialist
advanced
physicians
argument
autopsy
slides
ate
inhalation
circumstantial
marion
portraying
trapped
sting
suggestion
cocaine
repeatedly
steered
secretly
videotaped
persuade
midway
videotape
smoked
crack
duties
zeal
witness
intent
badly
motivated
mad
span
maria
mccarthy
slapped
romantic
hell
jailed
refusing
misdemeanor
counts
lying
stems
presiding
barred
activist
augustus
supporter
liberties
appeals
overturn
barring
islam
courtroom
potentially
passes
totalitarian
bishop
pointing
slowdown
industrials
commerce
shelves
eased
closely
watched
currencies
intervention
lifted
lows
currency
ninth
entrenched
flaws
opec
upbeat
believing
slowed
sustainable
brokers
watchers
crash
attendant
publicity
hurricane
gradually
strengthened
threaten
joan
centered
latitude
sustained
gusts
spotted
satellite
upgraded
storms
hurricanes
billions
ravaged
islands
runs
broad
balance
shrank
exceeded
prospect
substantial
fresh
bonds
yields
drowning
swimming
martial
petty
tempe
ariz
manslaughter
commit
airman
appleton
instructors
stricken
shouted
quit
arguments
pre
cmdr
christopher
jacksonville
blacked
participating
drill
argued
irrelevant
unrelated
contended
attitude
skin
blue
cartoon
suffering
induced
pathologist
acquitted
judicial
punishment
prosecution
immunity
lawyers
vital
fill
facing
fernandez
teachers
titled
reminded
debris
advised
circular
friction
seconds
discard
faced
backlog
repair
generating
assist
achievement
empire
builder
developers
assisted
teams
academy
supervising
consist
institutes
creative
bottom
paperwork
permission
discontinued
ridiculed
vigil
doors
metropolitan
cathedral
madrid
legalization
common
scalpers
box
thin
nowadays
authentic
cinema
legalized
outlawed
palace
answered
legislator
discussion
bills
vegetables
minerals
woody
cat
snake
fellow
lawmaker
block
praying
insect
deer
flower
stone
songs
pass
symbols
finance
territories
plea
allocate
roads
divides
caretaker
obstacle
peacemaking
completely
insane
unrest
endanger
settle
denies
steering
diplomat
haaretz
palestinians
struggle
statehood
settlement
forming
avi
allocated
developing
expanding
sum
weinstein
likud
bloc
settling
hosni
mubarak
threatens
confrontation
governmental
grouping
adopt
strict
trucks
smog
failing
eleven
violate
monoxide
vermont
volatility
slated
formally
proposing
proceed
approval
originates
practically
epa
regulation
volatile
initiatives
notable
exception
pioneered
stricter
requirements
pollutants
nitrogen
oxides
fleets
replaced
researching
revisions
elimination
diesel
emission
powered
indicators
components
permitted
marketed
engine
carlson
motors
locate
aware
descending
severity
manchester
nassau
suffolk
syracuse
suburbs
middletown
providence
bedford
hancock
jefferson
lincoln
greyhound
striking
drivers
exchanged
stepping
tucson
unacceptable
mediator
disappointed
unusual
intimidation
yesterday
jeffrey
amalgamated
unions
condemn
discourage
wages
grievance
buses
replacements
crossed
picket
vandalism
walkout
fayetteville
magistrate
warrant
fred
ingram
charlotte
assaulting
harvey
harassment
mobile
ala
tulsa
okla
surrounded
pierce
package
pension
guarantee
hikes
contingent
bargaining
compromises
concessions
stayed
discouraged
opposition
korea
reunification
kim
jung
unauthorized
elaborate
announce
roh
tae
woo
favorably
pyongyang
aides
sung
inter
specifically
koreans
unification
invitation
ploy
lump
category
pose
indicted
lawmakers
dissident
trips
han
peaceful
zone
exchanges
prior
notification
exercises
invitations
observe
maneuvers
parliamentary
frequent
text
decree
banning
ordering
transmitted
translated
nevada
foothills
valleys
gusted
collins
casper
idaho
coasts
bermuda
platte
readings
sunny
remainder
andy
plastic
bidding
artist
sotheby
auction
possessions
turquoise
diana
fetched
estimate
lots
clips
buyer
collector
ruby
studded
diamonds
gold
diamond
depicted
profiles
brightly
colored
watches
decorated
length
smiling
bought
original
bore
tags
symbolize
contest
sells
dated
photo
image
visual
institutions
alfred
airlines
bigger
battling
sluggish
turbulence
finalized
slump
atlanta
hub
jewels
idea
bankruptcy
proceedings
barely
acquisitions
takeover
sheet
aggressor
racked
strife
steven
passenger
investigated
fixing
preferred
morale
beyer
consultant
faster
revenues
posts
resigned
indefinitely
cos
marriott
makers
cliff
bed
repayment
schedule
miller
restructuring
pays
hamilton
minneapolis
loads
routes
hires
machinists
lodge
draconian
collision
triggered
automatic
suspensions
disciplinary
emphasizes
performances
notice
proud
travelers
observed
reliable
bags
invest
cabin
acceptance
mistake
overrun
thugs
mob
argue
norway
league
anxiety
christie
oslo
parks
owe
till
witnessed
informal
poll
unarmed
capita
murdered
sweden
repercussions
comparing
prosecutions
compare
monetary
doubled
partly
accepted
traditionally
reserved
topic
debate
fashioned
robbers
rammed
burning
getaway
decay
fabric
blame
tenfold
lock
alarm
budgets
tabloid
mafia
devote
sensational
coverage
respected
reporting
trivial
highlights
armenia
armenian
ethnic
izvestia
square
yerevan
edition
disputed
nagorno
karabakh
shut
territorial
azerbaijan
enclave
predominantly
agitating
annexed
supports
riots
annexation
listened
normalize
demonstrations
disagreement
solve
restraint
stormy
laying
poisoning
factory
republics
autonomy
tolerate
whip
baltic
latvia
estonia
estonian
signatures
demonstration
tallinn
exact
eve
poster
publication
pact
cancer
beverly
hills
peg
trio
signature
tune
twilight
guitar
cousin
dunn
organ
dates
disbanded
recruited
musicians
tunes
lifetime
destiny
midnight
ranges
lighter
windy
deserts
mich
inch
mont
tenth
ely
nev
cia
stamps
stewart
imminent
editions
internal
stamp
collectors
debating
identities
kidnapped
sidon
colleagues
optimistic
elaborating
technicians
gunmen
lebanese
fatah
palestinian
abu
captors
moslem
militia
dominates
hostile
libyan
moammar
gadhafi
appealed
hostages
iranian
factions
irishman
journalist
terry
correspondent
captive
brent
keyboard
player
rock
band
dead
lafayette
coroner
foul
dennis
casey
grey
sets
spontaneous
jams
retain
concerts
lets
pig
liver
teen
ager
roll
bands
silver
rhythm
guitarist
weir
bobby
famous
jerry
requirement
walk
hide
audubon
daughters
lisa
regain
custody
confidential
courthouse
limousine
shielded
waited
garage
elizabeth
clad
weekends
folded
breaks
combined
disqualified
outpouring
disorderly
persons
offense
posting
bail
neglected
abused
lobby
alerted
mobilization
alert
surgical
barracks
smyrna
activated
shield
casualties
preventive
evacuation
inspect
field
explorer
expedition
pole
saints
athens
greece
missiles
composer
challenger
blasted
weeklong
melee
arabs
accidentally
easter
captivity
clergymen
captives
schroeder
recipient
overthrown
coup
thatcher
daylong
conductor
ivan
dixon
haggard
billy
dee
roy
michelle
skater
janet
backers
regulate
timothy
objected
filibuster
sponsor
inouye
hawaii
adjourn
itching
provisions
access
programming
broadcasters
virtually
veto
restored
oversight
omb
imposed
struggling
offering
automakers
guarantees
buyers
refund
title
license
fees
risking
ninety
recommend
towering
derrick
hole
suburban
dubbed
crude
rig
civilization
sinking
wells
covers
awarded
des
pinnacle
basin
stretching
theory
provoked
smiles
cute
tower
seismic
concede
erected
phone
installed
sites
promising
grinding
complicating
bored
boring
appreciation
nearby
deposit
geological
drilled
staked
unused
boat
owning
receives
rent
mineral
pump
finding
concorde
refined
violeta
barrios
chamorro
disarm
productive
cycle
sharply
succeeded
foes
removal
landslide
disband
drastic
tranquility
stability
explained
unity
interior
exit
visas
nicaraguans
obtain
virgilio
bitter
unexplained
accompany
loyalty
compensation
manville
asbestos
brooklyn
freeze
restructure
financially
ailing
sick
silverman
conclude
claimants
alter
deadline
overhaul
froze
drain
liability
lung
shortfall
consortium
funded
affiliated
minimize
transaction
providing
meaningful
sacrificing
effectively
denver
injunction
lawsuits
unrealistic
refinancing
direct
bolster
stephens
inject
repurchase
recommended
fully
sympathetic
courts
shortage
anticipated
worse
quicker
shipbuilding
litigation
diplomats
baghdad
emirate
boeing
airways
frankfurt
charter
nationals
howell
departure
lounge
spirits
blanket
odds
insistence
relinquish
tariq
aziz
algerian
chadli
bendjedid
missed
passengers
fly
boucher
wished
deter
hiding
shields
refuge
compounds
dual
citizenship
defied
deciding
ditch
meetings
vaclav
havel
plo
mediating
dealings
arrival
yasser
arafat
briefly
playwright
hebrew
assured
palestine
dialogue
sincerity
disappearance
indirect
intentions
moshe
arens
transit
elaboration
yosef
connections
militants
disrupt
influx
seized
hungary
bulgaria
unemployment
seasonally
adjusted
definition
adds
statistical
cigarettes
alternative
tar
suggests
option
cruel
introduced
rjr
nabisco
arbor
smokers
physical
psychological
nicotine
inhale
dropped
outnumbered
advances
nyse
helicopter
crashed
province
darien
extent
kin
notified
veteran
editor
perfect
capture
horror
writer
producer
nurse
volunteer
recreation
drama
deepest
laugh
webb
barber
pink
submarine
viewpoint
strictly
wealth
stories
writers
scripts
filmed
levy
newsweek
concept
bros
extensive
script
jason
epstein
editorial
contribution
authors
norman
gore
conceived
connected
books
extraordinary
roger
stevens
anchor
paperback
circulation
library
uniform
carries
fiction
futures
commodity
advance
retreated
grains
mixed
delivery
troy
ounce
faded
skidded
traded
metal
expensive
discouraging
viewed
crises
showdown
breakaway
lithuanian
shunned
precious
trader
neill
elders
bullish
tense
soybean
profit
beliefs
modestly
implements
halting
runaway
wheat
bushel
oats
technically
mercantile
intermediate
pork
bellies
storage
freezers
belly
hogs
astronauts
classified
spy
fantastic
dry
runway
ride
inspection
fiery
descent
touching
pst
landing
guests
journalists
delayed
cape
canaveral
sore
capt
dedicated
goodbye
jets
cheering
spectators
photographs
eavesdropping
electronically
amateur
astronomers
speeding
overhead
characteristic
twin
usual
earthquakes
enjoyed
joked
discussions
ascent
retire
shuttles
deploy
reservoir
trainer
taipei
unexpectedly
crushed
maggie
pure
bull
aged
kirk
techniques
contends
mishap
host
hospitalized
overdose
pills
foreclosure
swallowing
prescription
bottles
hallway
lunch
harley
gray
postponed
mom
cemetery
eric
dying
julie
involves
dairy
ned
woes
cow
supplier
herd
kurdish
semi
civilians
insurgents
brace
